{
  "title": "Cash Register",
  "description": "POS mobile‑first para restaurantes e bares.",
  "subtitle": "Sistema Moderno de Ponto de Venda",
  "overview": "Um POS web que simplifica os pedidos com uma interface otimizada para toque e ecrãs pequenos.",
  "coreConcept": {
    "summary": "Nasceu da necessidade de utilizar a app num evento rural do qual fiz parte da organização",
    "bullets": [
      "Desenvolvido em menos de 12 horas",
      "Desenvolvido iterativamente ao longo do evento em que foi utilizado",
      "Assegura a facilidade de acesso ao estar disponível online"
    ]
  },
  "features": [
    "Catálogo dividido em categorias de bebidas e comida com preços para cada produto",
    "Carrinho de compras com funcionalidades de adicionar ou remover produtos e ajustar quantidades",
    "Para mobile, um carrinho flutuante que facilita a navegação entre o último produto adicionado e o carrinho de compras",
    "Histórico de pedidos com timestamps, detalhes do pedido e atualizações em tempo real"
  ],
  "technical": {
    "frontendStack": [
      "Next.js 15 com App Router e geração estática",
      "React 19 com TypeScript",
      "Tailwind CSS",
      "Radix UI via shadcn/ui",
      "Lucide React para iconografia",
      "Sonner para notificações toast"
    ],
    "projectStructure": [
      "Backend Supabase com PostgreSQL, esquema tipado e RLS",
      "Subscrições em tempo real para atualizações em tempo real",
      "Componentes cliente/servidor separados por preocupação",
      "Operações de BD tipo‑seguras com tipos gerados",
      "UI modular em /components/ui e lógica de negócio em /lib",
      "Componentes chave: CashRegister, FloatingCartButton, OrderList, OrderDetails"
    ],
    "deployment": [
      "Construído e publicado via GitLab Pipelines",
      "Publicado em GitLab Pages"
    ]
  },
  "personalExperience": "Cash Register nasceu da necessidade durante um evento rural do qual fiz parte da organização. O desafio de construir um sistema POS funcional em menos de 12 horas foi intenso mas incrivelmente educativo. Trabalhar sob pressão de tempo forçou-me a tomar decisões arquiteturais rápidas e priorizar funcionalidades que seriam realmente usadas.\n\nO desenvolvimento iterativo durante o próprio evento foi uma experiência única - consegui ver utilizadores reais interagir com o sistema e fazer melhorias em tempo real. A funcionalidade de carrinho flutuante para mobile foi um resultado direto de ver pessoas lutarem com o design inicial.\n\nEste projeto ensinou-me o valor da simplicidade, iteração rápida e construir para restrições do mundo real. Usar Supabase para atualizações em tempo real foi crucial, e ver pedidos aparecerem instantaneamente em múltiplos dispositivos foi satisfatório. É um grande exemplo de como restrições podem levar a soluções criativas."
}
