{
  "title": "Cash Register",
  "description": "Mobile‑first POS for restaurants and bars.",
  "subtitle": "Modern Point of Sale System",
  "overview": "A web‑based POS that streamlines ordering with an interface tuned for touch and small screens.",
  "coreConcept": {
    "summary": "Born from the need to use the app at a rural event I helped organize.",
    "bullets": [
      "Developed in under 8 hours",
      "Evolved iteratively during the event where it was used",
      "Ensures easy access by being available online"
    ]
  },
  "features": [
    "Catalog split into drink and food categories with prices for each product",
    "Cart with add/remove functionality and quantity adjustments",
    "On mobile, a floating cart that makes it easy to jump between the last added item and the cart",
    "Order history with timestamps, order details, and real-time updates"
  ],
  "technical": {
    "frontendStack": [
      "Next.js 15 with App Router and static export capability",
      "React 19 with TypeScript",
      "Tailwind CSS for responsive styling",
      "Radix UI via shadcn/ui",
      "Lucide React for iconography",
      "Sonner for toast notifications"
    ],
    "projectStructure": [
      "Supabase backend with PostgreSQL, typed schema, and RLS",
      "Real-time subscriptions for live updates",
      "Client/server components separated by concern",
      "Type-safe DB operations with generated types",
      "Modular UI in /components/ui and business logic in /lib",
      "Key components: CashRegister, FloatingCartButton, OrderList, OrderDetails"
    ],
    "deployment": [
      "Built and published via GitLab Pipelines",
      "Deployed to GitLab Pages"
    ]
  },
  "personalExperience": "Cash Register was born out of necessity during a rural event I helped organize. The challenge of building a functional POS system in under 8 hours was intense but incredibly educational. Working under time pressure forced me to make quick architectural decisions and prioritize features that would actually be used.\n\nThe iterative development during the event itself was a unique experience - I was able to see real users interact with the system and make improvements on the fly. The floating cart feature for mobile was a direct result of watching people struggle with the initial design.\n\nThis project taught me the value of simplicity, rapid iteration, and building for real-world constraints. Using Supabase for real-time updates was crucial, and seeing orders appear instantly across multiple devices was satisfying. It's a great example of how constraints can lead to creative solutions."
}

