{
  "title": "UI Components Playground",
  "description": "Component library and playground to browse, test, and copy React UI across themes.",
  "subtitle": "React Component Library & Playground",
  "overview": "A modern library and playground for reusable React components across multiple themes. Discover components, tweak props live, and copy production-ready code.",
  "coreConcept": {
    "summary": "An integration hub for themed UI components.",
    "bullets": [
      "One set of components, 6+ themes (Minimal, Modern, Gradient, Rounded, Dark, Neon)",
      "Live props with instant preview and code output",
      "Copyable, production-ready snippets",
      "Consistent light/dark behavior"
    ]
  },
  "features": [
    "Curated components: Button, Card, Input, Slider, Switch, Textarea, Toggle",
    "Multiple themes with consistent palettes",
    "Interactive examples and real-time preview",
    "Prop editing with type safety and code generation",
    "Mobile-friendly interface with resizable panels",
    "Theme gallery for side-by-side comparison"
  ],
  "technical": {
    "frontendStack": [
      "Next.js 14 with App Router",
      "React 18 with TypeScript",
      "Tailwind CSS with extended safelist for dynamic class generation",
      "Framer Motion for animations",
      "Radix UI components via shadcn/ui",
      "Monaco Editor for code editing and syntax highlighting"
    ],
    "projectStructure": [
      "Dynamic Component Loading: runtime discovery and registration",
      "Example-based usage demos",
      "Theme integration: components adapt to selected theme",
      "Component tests for props and behavior",
      "Performance: dynamic imports and code splitting",
      "Mobile-first responsive design",
      "Theme management via CSS variables",
      "Component registry for discovery and metadata"
    ],
    "deployment": [
      "GitLab Pages",
      "Static export with dynamic features where needed",
      "Optimized bundle via code splitting and lazy loading"
    ]
  },
  "personalExperience": "The UI Components Playground was a fantastic learning experience that allowed me to explore component architecture and theme systems in depth. Building a system where components could adapt to multiple themes while maintaining consistency was challenging but rewarding. I learned a lot about CSS variables, dynamic class generation, and how to structure a component library for reusability. The interactive playground feature was particularly fun to implement, as it required real-time code generation and prop manipulation. This project helped me understand the importance of developer experience and how good tooling can accelerate development. It also reinforced my appreciation for well-designed component APIs and the power of composition in React."
}

