{
  "title": "Caja Registradora",
  "description": "POS móvil para restaurantes y bares.",
  "subtitle": "Sistema Moderno de Punto de Venta",
  "overview": "Un POS basado en web que simplifica los pedidos con una interfaz optimizada para táctil y pantallas pequeñas.",
  "coreConcept": {
    "summary": "Nació de la necesidad de usar la app en un evento rural del que formé parte de la organización.",
    "bullets": [
      "Desarrollado en menos de 12 horas",
      "Evolucionado iterativamente durante el evento en el que se utilizó",
      "Garantiza facilidad de acceso al estar disponible en línea"
    ]
  },
  "features": [
    "Catálogo dividido en categorías de bebidas y comida con precios para cada producto",
    "Carrito de compras con funcionalidades para añadir o quitar productos y ajustar cantidades",
    "En móvil, un carrito flotante que facilita la navegación entre el último producto añadido y el carrito",
    "Historial de pedidos con timestamps, detalles del pedido y actualizaciones en tiempo real"
  ],
  "technical": {
    "frontendStack": [
      "Next.js 15 con App Router y generación estática",
      "React 19 con TypeScript",
      "Tailwind CSS",
      "Radix UI vía shadcn/ui",
      "Lucide React para iconografía",
      "Sonner para notificaciones toast"
    ],
    "projectStructure": [
      "Backend Supabase con PostgreSQL, esquema tipado y RLS",
      "Suscripciones en tiempo real para actualizaciones en vivo",
      "Componentes cliente/servidor separados por responsabilidad",
      "Operaciones de BD tipo‑seguras con tipos generados",
      "UI modular en /components/ui y lógica de negocio en /lib",
      "Componentes clave: CashRegister, FloatingCartButton, OrderList, OrderDetails"
    ],
    "deployment": [
      "Construido y publicado vía GitLab Pipelines",
      "Publicado en GitLab Pages"
    ]
  },
  "personalExperience": "Caja Registradora nació de la necesidad durante un evento rural del que formé parte de la organización. El desafío de construir un sistema POS funcional en menos de 12 horas fue intenso pero increíblemente educativo. Trabajar bajo presión de tiempo me obligó a tomar decisiones arquitectónicas rápidas y priorizar características que realmente se usarían. El desarrollo iterativo durante el propio evento fue una experiencia única: pude ver usuarios reales interactuar con el sistema y hacer mejoras sobre la marcha. La funcionalidad de carrito flotante para móvil fue un resultado directo de ver a personas luchar con el diseño inicial. Este proyecto me enseñó el valor de la simplicidad, la iteración rápida y construir para restricciones del mundo real. Usar Supabase para actualizaciones en tiempo real fue crucial, y ver pedidos aparecer instantáneamente en múltiples dispositivos fue satisfactorio. Es un gran ejemplo de cómo las restricciones pueden llevar a soluciones creativas."
}
