{
  "title": "Sonora",
  "description": "Audiolibros interactivos con narración de IA e historias ramificadas.",
  "subtitle": "Plataforma de Audiolibros Interactivos con IA",
  "overview": "Plataforma de audiolibros interactivos con narración de IA e historias basadas en elecciones. Elige una voz, explora múltiples caminos y genera audio en tiempo real.",
  "coreConcept": {
    "summary": "Audiolibros interactivos con narración de IA.",
    "bullets": [
      "Historias ramificadas con múltiples finales",
      "Voces de IA vía ElevenLabs y OpenAI",
      "Audio en tiempo real con sincronización a nivel de palabra y subtítulos",
      "Creación y gestión de voces personalizadas",
      "Respaldo de audio pregrabado",
      "Reproductor responsivo con línea de tiempo, repetición y elecciones"
    ]
  },
  "features": [
    "Biblioteca: 10+ historias interactivas (ej. El Bosque Encantado, La Biblioteca de Medianoche, Proyecto Hail Mary)",
    "Voces: crear y previsualizar voces personalizadas; TTS de alta calidad",
    "Navegación ramificada con elecciones del usuario",
    "Reproductor: línea de tiempo, repetición, avance automático",
    "Rendimiento: respaldo pregrabado y detección inteligente de fuente",
    "Diseño: optimizado para móvil con temas claro/oscuro"
  ],
  "technical": {
    "frontendStack": [
      "Next.js 15 (App Router, generación estática)",
      "React 19 con TypeScript",
      "Tailwind CSS",
      "Framer Motion (efectos de tarjetas 3D)",
      "Radix UI vía shadcn/ui",
      "Componentes de tarjetas 3D personalizados"
    ],
    "projectStructure": [
      "Motor de historias basado en nodos (elecciones, tiempo)",
      "Pipeline de audio para TTS y subtítulos",
      "CRUD de gestión de voces",
      "Reproductor avanzado (línea de tiempo, repetición, elecciones)",
      "Datos de historias tipo-seguros",
      "Integraciones: ElevenLabs + OpenAI",
      "Generación estática con carga diferida y división de código"
    ],
    "deployment": [
      "Sitio estático con características dinámicas",
      "Recursos de audio organizados con metadatos",
      "Configuración de entorno segura y builds optimizados"
    ]
  },
  "personalExperience": "Sonora fue uno de mis proyectos técnicamente más desafiantes. Trabajar con generación de audio en tiempo real, sincronización a nivel de palabra y narrativas ramificadas requirió que me sumergiera profundamente en el procesamiento de audio y gestión de estado. Integrar con las APIs de ElevenLabs y OpenAI me enseñó mucho sobre trabajar con servicios externos y manejar operaciones asíncronas de manera eficiente. El sistema de historias ramificadas fue particularmente interesante de arquitectar, ya que requirió consideración cuidadosa de la gestión de estado y flujo del usuario. Construir el reproductor de audio con controles de línea de tiempo y sincronización de subtítulos fue una gran experiencia de aprendizaje en el manejo de medios. Este proyecto en Binedge me permitió trabajar con tecnología de vanguardia y empujar los límites de lo que pensaba que era posible con tecnologías web. La satisfacción de ver usuarios navegar a través de historias interactivas con voces generadas por IA fue increíble."
}
